app/services/booking_service.rb

  def add_reserved_date
    (@booking.start_date..@booking.end_date).each do |date|
      # byebug
      @booking.flat.reserved_date.push(date)
      @booking.flat.save
---
UPDATE "flats" SET "reserved_date" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["reserved_date", "{0018-08-06}"], ["updated_at", "2018-08-03 14:37:31.328224"], ["id", 3]]
UPDATE "flats" SET "reserved_date" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["reserved_date", "{2018-08-15,2018-08-16,2018-08-17,2018-08-16,2018-08-17,2018-08-18}"], ["updated_at", "2018-08-08 11:44:36.731948"], ["id", 1]]

  def remove_reserved_date
    (@booking.start_date..@booking.end_date).each do |date|
      # byebug
      @booking.flat.reserved_date.delete(date)
      @booking.flat.save
---
UPDATE "flats" SET "reserved_date" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["reserved_date", "{2018-08-15,2018-08-17,2018-08-17,2018-08-18,2018-08-19,2018-08-20,2018-08-21}"], ["updated_at", "2018-08-08 12:00:25.311306"], ["id", 1]]