app/views/flats/index.html.erb

SELECT DISTINCT city FROM "flats"
---
        <%= label_tag "filter[city]", "City" %>
        <%= select_tag "filter[city]", options_from_collection_for_select(Flat.select('DISTINCT city'), :city, :city, params[:filter].present? ? params[:filter][:city] : nil), include_blank: true, class: "form-control mr-sm-2" %>