app/views/users/index.html.erb

SELECT COUNT(*) FROM "flats" WHERE "flats"."user_id" = $1  [["user_id", 1]]
---
          <td><%= link_to vendor.name, user_path(vendor.id) %></td>
          <td><%= vendor.flats.size %></td>