app/views/users/show.html.erb

    <div class="profile-info-value">
      <span><%= @user.flats.count %></span>
---
SELECT COUNT(*) FROM "flats" WHERE "flats"."user_id" = ?  [["user_id", 2]]