app/policies/flat_policy.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def destroy?
    return true if user.present? && user == flat.user