app/queries/flats_query.rb

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."flat_id" = $1 ORDER BY "bookings"."id" ASC LIMIT $2  [["flat_id", 2], ["LIMIT", 1000]]
---
  def reserved_date_array(flat)
    arr = []
    Booking.where(flat_id: flat).find_each do |book|