app/controllers/bookings_controller.rb

SELECT "bookings".* FROM "bookings" INNER JOIN "flats" ON "flats"."id" = "bookings"."flat_id" WHERE "flats"."user_id" = $1  [["user_id", 1]]
---
  def vendor_booking
    @bookings = Booking.joins(:flat).where(flats: { user_id: current_user.id })

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def set_booking
    @booking = Booking.find(params[:id])