app/controllers/bookings_controller.rb

  def index
    @bookings = Booking.where(user_id: current_user.id)
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 1]]

  def vedor_booking
    @bookings = Booking.joins(:flat).where(flats: { user_id: current_user.id })
---
SELECT "bookings".* FROM "bookings" LEFT OUTER JOIN "flats" ON "flats"."id" = "bookings"."flat_id" WHERE "flat"."user_id" = $1  [["user_id", 1]]

  def new
    @booking = Booking.new
    @flat = Flat.find(params[:flat_id])
---
SELECT  "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @booking = current_user.bookings.build(booking_params)
    @booking.flat_id = params[:flat_id]

    if @booking.save
---
INSERT INTO "bookings" ("user_id", "flat_id", "created_at", "updated_at", "notice", "start_date", "end_date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 43]]

  def set_booking
    @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]