app/controllers/flats_controller.rb

  def show
    # @reserved = FlatsQuery.new.reserved_date_array(@flat.id)
    @bookings = Booking.where(flat_id: params[:id])
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."flat_id" = $1  [["flat_id", 1]]