app/controllers/flats_controller.rb

  def index
    @flats = Flat.filter(params[:filter]).page(params[:page])
---
SELECT  "flats".* FROM "flats" WHERE (id NOT IN (SELECT "bookings"."flat_id" FROM "bookings" WHERE (((end_date >= '2018-08-15' AND end_date <= '2018-08-17') OR (start_date >= '2018-08-15' AND start_date <= '2018-08-17')) OR (start_date <= '2018-08-15' AND end_date >= '2018-08-17')))) ORDER BY flats.created_at ASC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "flats" WHERE (id NOT IN (SELECT "bookings"."flat_id" FROM "bookings" WHERE (((end_date >= '2018-08-15' AND end_date <= '2018-08-17') OR (start_date >= '2018-08-15' AND start_date <= '2018-08-17')) OR (start_date <= '2018-08-15' AND end_date >= '2018-08-17'))))

  def create
    @flat = current_user.flats.build(flat_params)
    authorize @flat

    if @flat.save
---
INSERT INTO "flats" ("name", "address", "description", "capacity", "price", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "city") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def update
    if @flat.update(flat_params)
---
UPDATE "flats" SET "price" = $1, "updated_at" = $2 WHERE "flats"."id" = $3  [["price", 5959], ["updated_at", "2018-08-01 13:52:42.892703"], ["id", 1]]

  def destroy
    @flat.destroy
---
DELETE FROM "flats" WHERE "flats"."id" = $1  [["id", 9]]

  def set_flat
    @flat = Flat.find(params[:id])
---
SELECT  "flats".* FROM "flats" WHERE "flats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]