app/controllers/messages_controller.rb

  def index
    @messages = Message.where(recipient: current_user.id)
---
SELECT "messages".* FROM "messages" WHERE "messages"."recipient" = $1  [["recipient", 1]]

  def new
    @message = Message.new
    if params[:recipient]
      @recipient = User.find(params[:recipient])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @message = current_user.messages.build(message_params)

    if @message.save
      @recipient = User.find(@message.recipient)
---
INSERT INTO "messages" ("user_id", "recipient", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["recipient", 1], ["body", "Can you pay cash instead credit card?"], ["created_at", "2018-08-15 14:42:53.183849"], ["updated_at", "2018-08-15 14:42:53.183849"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]