app/controllers/users_controller.rb

  def index
    @vendors = User.where(vendor: true)
---
SELECT "users".* FROM "users" WHERE "users"."vendor" = $1  [["vendor", true]]

  def show
    @user = User.friendly.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]